In [1]:
import pandas as pd
import numpy as np

In [3]:
nums = [1, 2, 3, 4,5]
s = pd.Series(nums)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
s = pd.Series(nums,index=[1,2,3,4,5])
print(s)

1    1
2    2
3    3
4    4
5    5
dtype: int64

In [6]:
fruits = ['Orange','Banana','Mango']
fruits_pd = pd.Series(fruits,index=[1,2,3])
fruits_pd

1    Orange
2    Banana
3     Mango
dtype: object

In [7]:
dct = {'name':'Asabeneh','country':'Finland','city':'Helsinki'}
d = pd.Series(dct)
d

name       Asabeneh
country     Finland
city       Helsinki
dtype: object

In [8]:
data = [
    ['Asabeneh', 'Finland', 'Helsink'], 
    ['David', 'UK', 'London'],
    ['John', 'Sweden', 'Stockholm']
]
df = pd.DataFrame(data,columns=['Name','Country','City'])
print(df)

       Name  Country       City
0  Asabeneh  Finland    Helsink
1     David       UK     London
2      John   Sweden  Stockholm

In [9]:
data = {'Name': ['Asabeneh', 'David', 'John'], 'Country':[
    'Finland', 'UK', 'Sweden'], 'City': ['Helsiki', 'London', 'Stockholm']}
df = pd.DataFrame(data)
print(df)

       Name  Country       City
0  Asabeneh  Finland    Helsiki
1     David       UK     London
2      John   Sweden  Stockholm

In [10]:
data = [
    {'Name': 'Asabeneh', 'Country': 'Finland', 'City': 'Helsinki'},
    {'Name': 'David', 'Country': 'UK', 'City': 'London'},
    {'Name': 'John', 'Country': 'Sweden', 'City': 'Stockholm'}]
df = pd.DataFrame(data)
df

       Name  Country       City
0  Asabeneh  Finland   Helsinki
1     David       UK     London
2      John   Sweden  Stockholm

In [13]:
import pandas as pd
df = pd.read_csv('./data/weight-height.csv')
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [14]:
print(df.head())

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [15]:
df.tail()

      Gender     Height      Weight
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

In [16]:
df.shape

(10000, 3)

In [17]:
df.columns

Index(['Gender', 'Height', 'Weight'], dtype='object')

In [19]:
heights = df['Height']
heights

0       73.847017
1       68.781904
2       74.110105
3       71.730978
4       69.881796
          ...
9995    66.172652
9996    67.067155
9997    63.867992
9998    69.034243
9999    61.944246
Name: Height, Length: 10000, dtype: float64

In [20]:
print(heights.describe())

count    10000.000000
mean        66.367560
std          3.847528
min         54.263133
25%         63.505620
50%         66.318070
75%         69.174262
max         78.998742
Name: Height, dtype: float64

In [21]:
df.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [22]:
import pandas as pd
import numpy as np

data=[{"Name": "Asabeneh", "Country":"Finland","City":"Helsinki"},
    {"Name": "David", "Country":"UK","City":"London"},
    {"Name": "John", "Country":"Sweden","City":"Stockholm"}]
df = pd.DataFrame(data)
df

       Name  Country       City
0  Asabeneh  Finland   Helsinki
1     David       UK     London
2      John   Sweden  Stockholm

In [23]:
weights = [74, 78, 69]
df['Weight'] = weights
df

       Name  Country       City  Weight
0  Asabeneh  Finland   Helsinki      74
1     David       UK     London      78
2      John   Sweden  Stockholm      69

In [24]:
heights = [173, 175, 169]
df['Height'] = heights
df

       Name  Country       City  Weight  Height
0  Asabeneh  Finland   Helsinki      74     173
1     David       UK     London      78     175
2      John   Sweden  Stockholm      69     169

In [25]:
df['Height'] = df['Height'] * 0.01
df

       Name  Country       City  Weight  Height
0  Asabeneh  Finland   Helsinki      74    1.73
1     David       UK     London      78    1.75
2      John   Sweden  Stockholm      69    1.69

In [26]:
def calculate_bmi():
    weights = df['Weight']
    heights = df['Height']
    bmi = []
    for w,h in zip(weights,heights):
        b = w/(h*h)
        bmi.append(b)
    return bmi
bmi = calculate_bmi()
df['BMI'] = bmi
df

       Name  Country       City  Weight  Height        BMI
0  Asabeneh  Finland   Helsinki      74    1.73  24.725183
1     David       UK     London      78    1.75  25.469388
2      John   Sweden  Stockholm      69    1.69  24.158818

In [28]:
df['BMI'] =round(df['BMI'],1)
df

       Name  Country       City  Weight  Height   BMI
0  Asabeneh  Finland   Helsinki      74    1.73  24.7
1     David       UK     London      78    1.75  25.5
2      John   Sweden  Stockholm      69    1.69  24.2

In [29]:
df['BirthYear'] = ['1769', '1985', '1990']
df['CurrentYear'] = pd.Series(2020,index=[0,1,2])
df

       Name  Country       City  Weight  Height   BMI BirthYear  CurrentYear
0  Asabeneh  Finland   Helsinki      74    1.73  24.7      1769         2020
1     David       UK     London      78    1.75  25.5      1985         2020
2      John   Sweden  Stockholm      69    1.69  24.2      1990         2020

In [30]:
print(df.Weight.dtype)

int64

In [31]:
df['BirthYear'].dtype

dtype('O')

In [32]:
df['BirthYear'] = df['BirthYear'].astype('int')
print(df['BirthYear'].dtype)

int64

In [33]:
ages = df['CurrentYear'] - df['BirthYear']
df['Age'] = ages
df

,Name,Country,City,Weight,Height,BMI,BirthYear,CurrentYear,Age
0,Asabeneh,Finland,Helsinki,74,1.73,24.7,1769,2020,251
1,David,UK,London,78,1.75,25.5,1985,2020,35
2,John,Sweden,Stockholm,69,1.69,24.2,1990,2020,30

In [36]:
df[df['Age']<120]

    Name Country       City  Weight  Height   BMI  BirthYear  CurrentYear  Age
1  David      UK     London      78    1.75  25.5       1985         2020   35
2   John  Sweden  Stockholm      69    1.69  24.2       1990         2020   30